Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.OuterFillet
Outer Fillet - Corner fillet outer radius.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.InnerFillet
Inner Fillet - Corner fillet inner radius.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.WallDesignThickness
Represents wall design thickness of rectangle.
Remarks:
Design thickness of pipe wall is value should be thinner value than measured real value (nominal).
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.WallNominalThickness
Represents wall nominal thickness of rectangle.
Remarks:
Nominal is measured real value of profile, should be thicker than designed.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
Creates a new instance of Rectangular Pipe  shape.
width:
Section width.
height:
Section height, depth.
wallNominalThickness:
Represents wall nominal thickness of rectangle.
wallDesignThickness:
Represents wall design thickness of rectangle.
innerFillet:
Inner Fillet - Corner fillet inner radius.
outerFillet:
Outer Fillet - Corner fillet outer radius.
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
analysisParams:
Common set of parameters for structural analysis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
Defines parameters for Rectangular Pipe structural section.
Since:
2018